package game;

import java.util.Random;

public class 후니 { // https://wikidocs.net/214 참고하기
				// 후니의 스펙현황 어떻게 확인할 수 있을지 고민해보기
	
	//객체의 속성 > 멤버변수, 특성, 필드, 상태 등인데 변수로 정의해줄 수 있다
	
	String 이름; // 후니라는 클래스에 문자열을 담을 수 있는 '이름'이라는 객체변수를 만들었다.
	int 나이; // 후니라는 클래스에 숫자를 담을 수 있는 '나이'라는 객체변수를 만들었다 
	String 희망은행;

	static int 후니_서류지수 ;
	static int 후니_필기지수 ;
	static int 후니_면접지수 ;

	static int 후니_체력지수 ;
	static int 후니_자존감지수 ;
	static int 후니_스트레스지수 ;
	
	//기본생성자
	public 후니() {
		
	}

	public static boolean 자격증취득() {
		Random random = new Random();
		boolean result = false;
		int rate = 0;
		
		rate = (int)random.nextInt(100); 
		
		if(rate >= 50) { //  50%의 확률로 합격!
			result = true;
		}
		return result;
	}
	//객체의 기능 > 메써드, 행위, 함수 등이다. // 클래스내의 함수를 메소드라고 부른다 //입력을 가지고 어떤 일을 수행한 다음에 결과물을 내어놓는 것

	//입력: String 이름
	//출력: void (리턴값 없음)
	//즉, 입력으로 '이름'이라는 문자열을 받고 출력은 없는 형태의 메소드이다. 
	
	//겨울방학
//	public void 컴퓨터자격증() {
//		후니_서류지수 += 10;
//		후니_체력지수 -= 10;
//		후니_자존감지수 += 5;
//		후니_스트레스지수 += 5;
//	}
//
//	public void 어학자격증() {
//		후니_서류지수 += 10;
//		후니_체력지수 -= 10;
//		후니_자존감지수 += 5;
//		후니_스트레스지수 += 5;
//
//	}
//
//	public void 금융자격증() {
//		후니_서류지수 += 5;
//		후니_필기지수 += 5;
//		후니_체력지수 -= 10;
//		후니_자존감지수 += 5;
//		후니_스트레스지수 += 5;
//
//	}
	
	public void 여행() {
		후니_스트레스지수 -= 20;
	}
	
	public void 취준포기() {
		후니_자존감지수 -= 100;
		후니_스트레스지수 -= 100;
	}
	
	//학기 중
	//학교를 선택하면
	public void 학점관리() {
		후니_서류지수 += 1;
		후니_필기지수 += 9;
		후니_체력지수 -= 10;
		System.out.println("학점관리를 통해 서류지수 1, 필기지수 9 상승! 체력지수 10 하락!");
	}
	
	public void 금융동아리모임_참석() {
		후니_서류지수 += 8;
		후니_필기지수 += 2;
		후니_면접지수 += 5;
		후니_스트레스지수 += 5;
		후니_체력지수 -= 10;
		후니_자존감지수 -= 10;
		System.out.println("동아리모임을 통해 각종 정보를 교류해 서류지수 8, 필기지수 2, 면접지수 5씩 상승!");
		System.out.println("대신 체력지수 10 하락, 자신의 부족함 때문에 자존감지수 10하락, 스트레지수 5 상승!");

	}
	
	public void 취업지원본부_컨설팅() {
		후니_서류지수 += 5;
		후니_필기지수 += 5;
		후니_면접지수 += 5;
		후니_스트레스지수 += 5;
		후니_체력지수 -= 10;
		후니_자존감지수 -= 10;
		System.out.println("취업지원본부의 컨설팅 덕분에 서류지수, 필기지수, 면접지수 5씩 상승!");
		System.out.println("대신 체력지수 10 하락, 자신의 부족함 때문에 자존감지수 10하락, 스트레지수 5 상승!");
		
	}

	public void 면접스터디_참석() {
		후니_면접지수 += 15;
		후니_스트레스지수 += 5;
		후니_자존감지수 -= 5;
		후니_체력지수 -= 5;
		System.out.println("면접지수 15 상승!");
		System.out.println("스트레스지수 5 상승!");
		System.out.println("자존감지수와 체력지수 5 하락!");
	}
	
	//동네를 선택하면
	
	public void 헬스장() {
		후니_체력지수 += 20;

		System.out.println("체력지수 20 상승");
	}
	
	public void 치맥() {

		후니_스트레스지수 -= 15;
		후니_체력지수 -= 5;
		System.out.println("스트레스지수 15 하락!");
		System.out.println("체력지수 5 하락!");
	}
	
	//집을 선택하면
	
	public void 부모님과식사() {
		후니_스트레스지수 += 10;
		후니_체력지수 += 10;
		System.out.println("체력지수와 스트레스지수 10 상승!");
	}
	
	public void 일기() {
		후니_자존감지수 += 10;
		후니_스트레스지수 -= 10;
		System.out.println("자존감지수 10 상승! 스트레스지수 10 하락!");
	}
	
	public void 낮잠() {
		후니_체력지수 += 10;
		후니_자존감지수 -= 10;
	
		System.out.println("아 또 잤어... 오늘 공부할 내용 많았는데..ㅠㅠ ");
		System.out.println("이제 넘치는 기분으로 공부 좀 해볼까?!");
		System.out.println("체력지수 10 상승! 자존감지수 10 하락!");
	
	}
	
//	//여름방학
//	
	public void 현장실습() {
		후니_서류지수 += 5;
		후니_면접지수 += 5;
		후니_자존감지수 += 10;
		후니_스트레스지수 += 5;
		후니_체력지수 -= 15;
	}

	public void 공모전() {
		후니_서류지수 += 5;
		후니_면접지수 += 5;
		후니_스트레스지수 += 5;
		후니_체력지수 -= 15;
	}
	
	//하반기
	
	public void 명절간다() {
		후니_자존감지수 += 10;
		후니_스트레스지수 += 5;
		후니_체력지수 -= 5;
	}

	public void 명절안간다() {
		후니_자존감지수 += 5;
		후니_스트레스지수 += 5;
		후니_체력지수 += 5;
	}
		
	//상태창확인
	public static void 상태알림() {
//		이 곳에서 후니의 스텟이 0보다 작은지, 100보다 큰지 확인해주고, 만약 조건에 부합하지 않으면 0이나 100으로 만들어준뒤 게임을 종료시키자.
		
	System.out.println(" ");
	System.out.println("===========================================================");	
	System.out.println(" ");
	System.out.println("<< 후니의 현재스텟 >>");	

	//서류지수
	if(후니_서류지수 >= 100) {
		System.out.println("현재 서류지수 = " + 100 );
	}else {
		System.out.println("현재 서류지수 = " + 후니_서류지수 );
	}
	
	//필기지수
	if(후니_필기지수 >= 100) {
		System.out.println("현재 필기지수 = " + 100);
	}else {
		System.out.println("현재 필기지수 = " + 후니_필기지수 );
	}
	
	//면접지수
	if(후니_면접지수 >= 100) {
		System.out.println("현재 면접지수 = " + 100);
	}else {
		System.out.println("현재 면접지수 = " + 후니_면접지수 );
	}
	
	//체력지수
	if(후니_체력지수 > 100) {
		후니_체력지수 = 100;
		System.out.println("현재 체력지수 = " + 후니_체력지수);
		
	}else if(후니_체력지수 <= 0){
		System.out.println("현재 체력지수 = " + 후니_체력지수 + "  >>>>>>>>>>> 체력관리에 실패해 게임이 종료되었습니다.");
		
		GoodbyeWorldBgm GoodbyeWorldBgm = new GoodbyeWorldBgm();
		
        try {
        	GoodbyeWorldBgm.LoadBgm();
             Thread.sleep(0);
        }catch(InterruptedException e) {
             e.printStackTrace();
        }
		
		String GameEnd[] = { // 타이핑 쓰레드 - 익명 클래스

				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@=;:;;;;:=#@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@#-*@@@@@@@@@@@$-*@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@*;@@@@@@@@@@@@@@@@@=;#@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@!!@@@@@@@@@@@@@@@@@@@@@$!@@@@@@@@@@@@@",
				"@@@@@@@@@@#;@@@@@@@@@@@@@@@@@@@@@@@@@=*@@@@@@@@@@@",
				"@@@@@@@@@$$@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@@",
				"@@@@@@@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@",
				"@@@@@@@*#@@@@@~~~~~~$@@@@@@@@@@@*~!@@@@@@;@@@@@@@@",
				"@@@@@@$#@@@@@@      =@@@@@@@@@@@: ~@@@@@@@;@@@@@@@",
				"@@@@@@=@@@@@@@  !@@@@@;** ;@@#.,: ~@@@@@@@@=@@@@@@",
				"@@@@@~@@@@@@@@      ##     *@     ~@@@@@@@@=@@@@@@",
				"@@@@*@@@@@@@@@      ##  @. != .@- ~@@@@@@@@@~@@@@@",
				"@@@@!@@@@@@@@@  !@@@@#  @, !! ~@: ~@@@@@@@@@@#@@@@",
				"@@@=#@@@@@@@@@      ;#  @, !@  $  ~@@@@@@@@@@;@@@@",
				"@@@!@@@@@@@@@@      ;#  @, *@-  ; ~@@@@@@@@@@=@@@@",
				"@@@!@@@@@@@@@@@@@@@@@@@@@@@@@@#@@@@@@@@@@@@@@@=@@@",
				"@@#$@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@;@@@",
				"@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@;@@@",
				"@@=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#@@@@@@$-  -=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#$@@@@#      =@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*@@@",
				"@@@;@@@@, .@@ ;$@@-..~@@~~@,.@=.-@@@~.,$@@@@@#$@@@",
				"@@@!@@@@  ;@!!!*@     ~@         !@  .  :@@@@*@@@@",
				"@@@$#@@@  !@   ,@!:#!  @  ;=  @- -*  *:  @@@@;@@@@",
				"@@@@!@@@. -@=! ,@~  ;  @  *#  @~ -!  ,,,,@@@@@@@@@",
				"@@@@$@@@;  ..  ,@  @,  @  *#  @~ -$  #~ .@@@-@@@@@",
				"@@@@@-@@@-    -@@   -  @  *#  @~ -@:   .@@@*@@@@@@",
				"@@@@@@!@@@@##@@@@@#@@@@@@@@@@@@@@@@@@#@@@@#=@@@@@@",
				"@@@@@@$=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@@@@@",
				"@@@@@@@*#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@",
				"@@@@@@@@=$@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@",
				"@@@@@@@@@$!@@@@@@@@@@@@@@@@@@@@@@@@@@@$!@@@@@@@@@@",
				"@@@@@@@@@@@;@@@@@@@@@@@@@@@@@@@@@@@@@:$@@@@@@@@@@@",
				"@@@@@@@@@@@@$:@@@@@@@@@@@@@@@@@@@@@$;@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@=!$@@@@@@@@@@@@@@@#*;@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@#!!*#@@@@@@@#=!!=@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@#$=***=$#@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"
										                                                       
							    };

						        
							    for (int i = 0; i < GameEnd.length; i++) {
								      // 초 간 중지한다
								      try {
										Thread.sleep(250);
									} catch (InterruptedException e) {
										// TODO Auto-generated catch block
										e.printStackTrace();
									}
								      // 메세지를 출력한다
								      System.out.println(GameEnd[i]);
								} 
		
		System.exit(0);
		
	}else if(후니_체력지수 >= 1 && 후니_체력지수 <=20){
		System.out.println("현재 체력지수 = " + 후니_체력지수 + "  >>>>>>>>>>> 체력관리에 신경쓰세요.");

	}else {
		System.out.println("현재 체력지수 = " + 후니_체력지수 );
	}
	
	//자존감지수
	if(후니_자존감지수 > 100) {
		후니_자존감지수 = 100;
		System.out.println("현재 자존감지수 = " + 후니_자존감지수);
		
	}else if(후니_자존감지수 <= 0){
		System.out.println("현재 자존감지수 = " + 후니_자존감지수 + "  >>>>>>>>>>> 자존감관리에 실패해 게임이 종료되었습니다.");
		
		GoodbyeWorldBgm GoodbyeWorldBgm = new GoodbyeWorldBgm();
		
        try {
        	GoodbyeWorldBgm.LoadBgm();
             Thread.sleep(0);
        }catch(InterruptedException e) {
             e.printStackTrace();
        }
		
		String GameEnd[] = { // 타이핑 쓰레드 - 익명 클래스

				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@=;:;;;;:=#@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@#-*@@@@@@@@@@@$-*@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@*;@@@@@@@@@@@@@@@@@=;#@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@!!@@@@@@@@@@@@@@@@@@@@@$!@@@@@@@@@@@@@",
				"@@@@@@@@@@#;@@@@@@@@@@@@@@@@@@@@@@@@@=*@@@@@@@@@@@",
				"@@@@@@@@@$$@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@@",
				"@@@@@@@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@",
				"@@@@@@@*#@@@@@~~~~~~$@@@@@@@@@@@*~!@@@@@@;@@@@@@@@",
				"@@@@@@$#@@@@@@      =@@@@@@@@@@@: ~@@@@@@@;@@@@@@@",
				"@@@@@@=@@@@@@@  !@@@@@;** ;@@#.,: ~@@@@@@@@=@@@@@@",
				"@@@@@~@@@@@@@@      ##     *@     ~@@@@@@@@=@@@@@@",
				"@@@@*@@@@@@@@@      ##  @. != .@- ~@@@@@@@@@~@@@@@",
				"@@@@!@@@@@@@@@  !@@@@#  @, !! ~@: ~@@@@@@@@@@#@@@@",
				"@@@=#@@@@@@@@@      ;#  @, !@  $  ~@@@@@@@@@@;@@@@",
				"@@@!@@@@@@@@@@      ;#  @, *@-  ; ~@@@@@@@@@@=@@@@",
				"@@@!@@@@@@@@@@@@@@@@@@@@@@@@@@#@@@@@@@@@@@@@@@=@@@",
				"@@#$@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@;@@@",
				"@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@;@@@",
				"@@=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#@@@@@@$-  -=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#$@@@@#      =@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*@@@",
				"@@@;@@@@, .@@ ;$@@-..~@@~~@,.@=.-@@@~.,$@@@@@#$@@@",
				"@@@!@@@@  ;@!!!*@     ~@         !@  .  :@@@@*@@@@",
				"@@@$#@@@  !@   ,@!:#!  @  ;=  @- -*  *:  @@@@;@@@@",
				"@@@@!@@@. -@=! ,@~  ;  @  *#  @~ -!  ,,,,@@@@@@@@@",
				"@@@@$@@@;  ..  ,@  @,  @  *#  @~ -$  #~ .@@@-@@@@@",
				"@@@@@-@@@-    -@@   -  @  *#  @~ -@:   .@@@*@@@@@@",
				"@@@@@@!@@@@##@@@@@#@@@@@@@@@@@@@@@@@@#@@@@#=@@@@@@",
				"@@@@@@$=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@@@@@",
				"@@@@@@@*#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@",
				"@@@@@@@@=$@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@",
				"@@@@@@@@@$!@@@@@@@@@@@@@@@@@@@@@@@@@@@$!@@@@@@@@@@",
				"@@@@@@@@@@@;@@@@@@@@@@@@@@@@@@@@@@@@@:$@@@@@@@@@@@",
				"@@@@@@@@@@@@$:@@@@@@@@@@@@@@@@@@@@@$;@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@=!$@@@@@@@@@@@@@@@#*;@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@#!!*#@@@@@@@#=!!=@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@#$=***=$#@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"
										                                                       
							    };

						        
							    for (int i = 0; i < GameEnd.length; i++) {
								      // 초 간 중지한다
								      try {
										Thread.sleep(250);
									} catch (InterruptedException e) {
										// TODO Auto-generated catch block
										e.printStackTrace();
									}
								      // 메세지를 출력한다
								      System.out.println(GameEnd[i]);
								} 
		
		System.exit(0);
	}else if(후니_자존감지수 >= 1 && 후니_자존감지수 <=20){
		System.out.println("현재 자존감지수 = " + 후니_자존감지수 + "  >>>>>>>>>>> 자존감관리에 신경쓰세요.");

				
	}else {
		System.out.println("현재 자존감지수 = " + 후니_자존감지수 );
	}
	
	//스트레스지수
	if(후니_스트레스지수 < 0) {
		후니_스트레스지수 = 0;
		System.out.println("현재 스트레스지수 = " + 후니_스트레스지수);
		
	}else if(후니_스트레스지수 >= 100){
		System.out.println("현재 스트레스지수 = " + 후니_스트레스지수 + "  >>>>>>>>>>> 스트레스관리에 실패해 게임이 종료되었습니다.");
		
		GoodbyeWorldBgm GoodbyeWorldBgm = new GoodbyeWorldBgm();
		
        try {
        	GoodbyeWorldBgm.LoadBgm();
             Thread.sleep(0);
        }catch(InterruptedException e) {
             e.printStackTrace();
        }
		
		String GameEnd[] = { // 타이핑 쓰레드 - 익명 클래스

				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@=;:;;;;:=#@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@#-*@@@@@@@@@@@$-*@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@*;@@@@@@@@@@@@@@@@@=;#@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@!!@@@@@@@@@@@@@@@@@@@@@$!@@@@@@@@@@@@@",
				"@@@@@@@@@@#;@@@@@@@@@@@@@@@@@@@@@@@@@=*@@@@@@@@@@@",
				"@@@@@@@@@$$@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@@",
				"@@@@@@@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@",
				"@@@@@@@*#@@@@@~~~~~~$@@@@@@@@@@@*~!@@@@@@;@@@@@@@@",
				"@@@@@@$#@@@@@@      =@@@@@@@@@@@: ~@@@@@@@;@@@@@@@",
				"@@@@@@=@@@@@@@  !@@@@@;** ;@@#.,: ~@@@@@@@@=@@@@@@",
				"@@@@@~@@@@@@@@      ##     *@     ~@@@@@@@@=@@@@@@",
				"@@@@*@@@@@@@@@      ##  @. != .@- ~@@@@@@@@@~@@@@@",
				"@@@@!@@@@@@@@@  !@@@@#  @, !! ~@: ~@@@@@@@@@@#@@@@",
				"@@@=#@@@@@@@@@      ;#  @, !@  $  ~@@@@@@@@@@;@@@@",
				"@@@!@@@@@@@@@@      ;#  @, *@-  ; ~@@@@@@@@@@=@@@@",
				"@@@!@@@@@@@@@@@@@@@@@@@@@@@@@@#@@@@@@@@@@@@@@@=@@@",
				"@@#$@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@;@@@",
				"@@*@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@;@@@",
				"@@=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#@@@@@@$-  -=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@",
				"@@#$@@@@#      =@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@*@@@",
				"@@@;@@@@, .@@ ;$@@-..~@@~~@,.@=.-@@@~.,$@@@@@#$@@@",
				"@@@!@@@@  ;@!!!*@     ~@         !@  .  :@@@@*@@@@",
				"@@@$#@@@  !@   ,@!:#!  @  ;=  @- -*  *:  @@@@;@@@@",
				"@@@@!@@@. -@=! ,@~  ;  @  *#  @~ -!  ,,,,@@@@@@@@@",
				"@@@@$@@@;  ..  ,@  @,  @  *#  @~ -$  #~ .@@@-@@@@@",
				"@@@@@-@@@-    -@@   -  @  *#  @~ -@:   .@@@*@@@@@@",
				"@@@@@@!@@@@##@@@@@#@@@@@@@@@@@@@@@@@@#@@@@#=@@@@@@",
				"@@@@@@$=@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@!@@@@@@@",
				"@@@@@@@*#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@",
				"@@@@@@@@=$@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@~@@@@@@@@@",
				"@@@@@@@@@$!@@@@@@@@@@@@@@@@@@@@@@@@@@@$!@@@@@@@@@@",
				"@@@@@@@@@@@;@@@@@@@@@@@@@@@@@@@@@@@@@:$@@@@@@@@@@@",
				"@@@@@@@@@@@@$:@@@@@@@@@@@@@@@@@@@@@$;@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@=!$@@@@@@@@@@@@@@@#*;@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@#!!*#@@@@@@@#=!!=@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@#$=***=$#@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@",
				"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"
										                                                       
							    };

						        
							    for (int i = 0; i < GameEnd.length; i++) {
								      // 초 간 중지한다
								      try {
										Thread.sleep(250);
									} catch (InterruptedException e) {
										// TODO Auto-generated catch block
										e.printStackTrace();
									}
								      // 메세지를 출력한다
								      System.out.println(GameEnd[i]);
								} 
		
		System.exit(0);
	
	}else if(후니_스트레스지수 >= 80 && 후니_스트레스지수 <=99){
		System.out.println("현재 스트레스지수 = " + 후니_스트레스지수 + "  >>>>>>>>>>> 스트레스관리에 신경쓰세요.");

		
	}else {
		System.out.println("현재 스트레스지수 = " + 후니_스트레스지수 );
	}
	System.out.println(" ");
	System.out.println("===========================================================");
	System.out.println(" ");
	
		
//	System.out.println("현재 서류지수 : " + 후니_서류지수 + "  현재 필기지수 : " + 후니_필기지수 + "  현재 면접지수 : " + 후니_면접지수);
//	System.out.println("현재 체력지수 : " + 후니_체력지수 + "  현재 자존감지수 : " + 후니_자존감지수 + "  현재 스트레스지수 : " + 후니_스트레스지수);
//	System.out.println("===========================================================");
//	System.out.println(" ");
	
//	if(후니_체력지수 == 0 || 후니_자존감지수 == 0 || 후니_스트레스지수 == 100) {
//		
//	}
		
	}
	
	//목표확인
//	public void 목표확인() {
//		
//	}
	
	
	//랜덤이벤트

//  은행인사팀 기능
//	public void 멘토링참석() {
//		후니_서류지수 += 5;
//		후니_필기지수 += 5;
//		후니_면접지수 += 5;
//		후니_체력지수 -= 15;
//
//	}
//
//	public void 멘토링불참() {
//		후니_서류지수 -= 5;
//		후니_필기지수 -= 5;
//		후니_면접지수 -= 5;
//		후니_체력지수 += 15;
//	}
	
	public void 취업박람회참석() {
		후니_서류지수 += 5;
		후니_필기지수 += 5;
		후니_면접지수 += 5;
		후니_체력지수 -= 15;

	}

	public void 취업박람회불참() {
		후니_서류지수 -= 5;
		후니_필기지수 -= 5;
		후니_면접지수 -= 5;
		후니_체력지수 += 15;
	}

// 과동기 기능
//	public void 과동기합격_축하() {
//		후니_자존감지수 += 10;
//		후니_스트레스지수 += 5;
//	}
//	
//	public void 과동기합격_읽씹() {
//		후니_자존감지수 -= 10;
//		후니_스트레스지수 -= 5;
//	}
	
	public void 취업스터디원쫑파티_참석() {
		후니_서류지수 += 5;
		후니_필기지수 += 5;
		후니_면접지수 += 5;
		후니_체력지수 -= 15;
	}
	
	public void 취업스터디원쫑파티_불참() {
		후니_자존감지수 -= 10;
		후니_스트레스지수 += 5;
		후니_체력지수 += 15;
	}
	
	
	public void 동생병간호() {
		후니_체력지수 -= 10;
		후니_스트레스지수 += 10;
	}

	public void 동생무시() {
		후니_체력지수 += 10;
		후니_스트레스지수 += 10;

	}

	
//	public void 걷다 () {
//        System.out.println("후니가 걷고 있다.");
//    }
 
}